InformationRegisters/ИзмененныеЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>ИзмененныеЭлектронныеКурсы</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ГотовКПубликации</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаНачалаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаОкончанияИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ЭлектронныйКурс</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеКурсы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ТипыЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлектронныхКурсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Тест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Учебник</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Слайдовый</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCORM</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЭлементовСодержанияЭлектронногоКурса.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Enum>
		<Properties>
			<Name>ТипыЭлементовСодержанияЭлектронногоКурса</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Начало</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Группа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Видео</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Звук</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлайдПрезентацииPowerPoint</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Тест</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Документ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументWord</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Глоссарий</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Финальный</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>YouTube</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>HTML</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>SCO</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДокументOpenOffice</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СлайдПрезентацииImpress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрезентацияPowerPoint</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПрезентацияImpress</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Архив</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>PDF</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Картинка</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ЭлектронныеКурсы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ЭлектронныеКурсы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>НомерРедакции</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерВерсии</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтартоваяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ФинальнаяСтраница</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СправочнаяИнформация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УдалитьТекстыЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глоссарий</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеГлоссарии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Презентация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Служебный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецЭлектронногоКурса</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ВладелецЭлектронногоКурса</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/СодержаниеЭлектронныхКурсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СодержаниеЭлектронныхКурсов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.ЭлектронныеКурсы</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Элемент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТеорияЭлектронныхКурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеРесурсы</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлементыЭлектронныхРесурсов</v8:Type>
						<v8:Type>cfg:CatalogRef.ЭлектронныеТесты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипЭлемента</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыЭлементовСодержанияЭлектронногоКурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПараметрыЗапуска</Name>
					<Comment>Item / parameters</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КоличествоПопыток</Name>
					<Comment>limitConditions / attemptLimit</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПродолжительностьПопытки</Name>
					<Comment>limitConditions / attemptAbsoluteDurationLimit (Тип: duration SCORM)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПорогВыполнения</Name>
					<Comment>completionThreshold</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДанныеИнициализации</Name>
					<Comment>dataFromLMS</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДействиеПослеИстеченияВремени</Name>
					<Comment>timeLimitAction</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ДействияПослеИстеченияВремениЭлектронногоКурса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Скрытый</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Гиперссылки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Привязка</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СодержаниеЭлектронныхКурсов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресВДокументе</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/ТестовыеВопросы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>ТестовыеВопросы</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Задание</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПоставщикиЭлектронныхКурсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипВопроса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыТестовыхВопросов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Картинка</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКолонкиЭлементов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеКолонкиВариантов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/РазработкаЭлектронныхКурсов/Ext/Module.bsl
#Область ПрограммныйИнтерфейс

// Общие операции с электронными курсами
//

// Устанавливает пометку удаления курса.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс.
//   ПометкаУдаления - Булево - пометка удаления.
//   КонтекстРедактирования - Произвольный - любое значение, которое
//   будет в дальнейшем доступно в обработчиках событий переопределяемого модуля.
//
Процедура УстановитьПометкуУдаленияЭлектронногоКурса(Знач ЭлектронныйКурс, Знач ПометкаУдаления, Знач КонтекстРедактирования = Неопределено) Экспорт
	
	ИмяПроцедуры = "РазработкаЭлектронныхКурсов.УстановитьПометкуУдаленияЭлектронногоКурса";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяПроцедуры, 
		"ЭлектронныйКурс",
		ЭлектронныйКурс, 
		Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяПроцедуры, 
		"ПометкаУдаления",
		ПометкаУдаления, 
		Новый ОписаниеТипов("Булево"));
		
	Справочники.ЭлектронныеКурсы.УстановитьПометкуУдаления(ЭлектронныйКурс, ПометкаУдаления, КонтекстРедактирования);
	
КонецПроцедуры

// Запускает процедуру публикации после внесения изменений в электронный курс.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс.
//   Публиковать - Булево - Если Истина, то курс будет опубликован, т.е. все 
//                          сделанные изменения станут доступны участникам при его изучении
//                          Если Ложь, то изменения будут зафиксированы для дальней правки,
//                          но участникам будет будет доступна старая версия курса.
//   ИдентификаторФормы - УникальныйИдентификатор - уникальный идентификатор формы, 
//                        во временное хранилище которой надо поместить результат выполнения процедуры.
//   КонтекстРедактирования - Произвольный - любое значение, которое будет в дальнейшем доступно
//                            в обработчиках событий переопределяемого модуля.
//
// Возвращаемое значение:
//   Структура - если Публиковать = Истина, то содержит 
//                данные фонового задания публикации. Подробнее см. описание ДлительныеОперации.ВыполнитьВФоне.
//                Курс будет готов к изучению только после успешного выполнения задания.
//
Функция ЗафиксироватьРедактированиеЭлектронногоКурса(Знач ЭлектронныйКурс, Знач Публиковать, Знач ИдентификаторФормы, Знач КонтекстРедактирования) Экспорт

	Если НЕ ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
		Возврат Неопределено;
	КонецЕсли;
		
	ПараметрыЗадания = Неопределено;
	
	НачатьТранзакцию();
	
	Попытка
		
		БлокировкаДанных = Новый БлокировкаДанных;
		ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЭлектронныеКурсы");
		ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлектронныйКурс);
		ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
		БлокировкаДанных.Заблокировать();		
		
		ЭлектронныйКурсОбъект = ЭлектронныйКурс.ПолучитьОбъект();
		ЭлектронныйКурсОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
		ЭлектронныйКурсОбъект.Записать(); // Обновляем дату курса, так как изменения могут быть,
		// не затрагивающие сам курс, например, удаление элемента.
		
		РегистрыСведений.ИзмененныеЭлектронныеКурсы.ЗафиксироватьИзменениеКурса(ЭлектронныйКурс, Публиковать);
		
		Если Публиковать Тогда
			
			// Запускаем публикацию в фоне
			
			ИмяПроцедуры = "РазработкаЭлектронныхКурсовСлужебный.ОпубликоватьВФоне";
			
			ПараметрыПроцедуры = Новый Структура;
			ПараметрыПроцедуры.Вставить("ЭлектронныйКурс", ЭлектронныйКурс);
			
			ПараметрыВыполнения	= ДлительныеОперации.ПараметрыВыполненияВФоне(ИдентификаторФормы);
			ПараметрыВыполнения.КлючФоновогоЗадания = Строка(ЭлектронныйКурс.УникальныйИдентификатор());	
			ПараметрыВыполнения.НаименованиеФоновогоЗадания = НСтр("ru = 'Электронные курсы: Публикация'");
			ПараметрыВыполнения.ЗапуститьВФоне = Истина;
			
			ПараметрыЗадания = ДлительныеОперации.ВыполнитьВФоне(ИмяПроцедуры, ПараметрыПроцедуры, ПараметрыВыполнения);
			
			// Вызываем метод переопределяемого модуля
			
			РазработкаЭлектронныхКурсовПереопределяемый.ПриОкончанииРедактированияЭлектронногоКурса(ЭлектронныйКурс, КонтекстРедактирования);
						
		КонецЕсли;
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	Возврат ПараметрыЗадания;
	
КонецФункции

// Операции с электронными курсами типа Тест
//

// Возвращает настройки и вопросы электронного курса типа Тест.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс.
//
// Возвращаемое значение:
//  Структура - структура теста. Значения структуры:
//      ЭлектронныйКурс (KEY) - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс типа Тест.
//      Родитель - СправочникСсылка.ЭлектронныеКурсы - Группа для размещения электронного курса.
//      Наименование (REQUIRED) - Строка - Наименование электронного курса типа Тест.
//      ПометкаУдаления (WRITEONLY) - Булево - Признак того, что следует удалить тест.
//      ВремяТестаВСекундах - Число - Максимальное общее время для прохождения теста в секундах.
//		КоличествоПопыток - Число - Максимальное количество попыток прохождения теста. 
//      КоличествоВопросов - Число - Максимальное количество вопросов, которое будет показано пользователю
//                                   при прохождении тестирования. Значение 0 означает, что это число
//                                   будет равно общему числу вопросов теста.
//      РазрешитьИсправлятьОшибки - Булево - Разрешить повторно ответить на вопрос в случае ошибки.
//      ПеремешиватьВопросы - Булево - Вопросы будут показываться в случайном порядке.
//      ПоказыватьРезультатОтвета - Булево - Тестируемый сразу после ответа узнает о том, правильно он 
//                                           ответил на вопрос или нет и увидит комментарий.
//      ПоказыватьСтатистику - Булево - После завершения тестирования будет показан список вопросов,
//                                      результаты ответов и комментарии.
//      ПоказыватьПравильныеОтветы - Булево - После завершения тестирования можно будет узнать правильные ответы (ключи).
//      ДатаИзменения (READONLY) - Дата - Дата последнего изменения элемента.
//      Служебный - Булево - Если Истина, то курс будет скрыт по умолчанию.
//      Владелец - ОпределяемыйТип.ВладелецЭлектронногоКурса - Определяет владельца электронного курса при
//                                                             создании программным способом.
//  	Вопросы - ТаблицаЗначений - Вопросы теста. Колонки таблицы:
//      	Ссылка (KEY) - СправочникСсылка.ТестовыеВопросы - Ссылка на тестовый вопрос.
//          ЭлектронныйКурс (READONLY) - СправочникСсылка.ЭлектронныеКурсы - Ссылка на электронный курс типа Тест.
//          ПометкаУдаления (WRITEONLY) - Булево - Признак того, что следует удалить вопрос.
//			Задание (REQUIRED) - ФорматированныйДокумент - Формулировка вопроса.
//          ТипВопроса (REQUIRED) - ПеречислениеСсылка.ТипыТестовыхВопросов - Тип вопроса.
//          Картинка - ДвоичныеДанные - Картинка вопроса.
//          ДатаИзменения (READONLY) - Дата - Дата последнего изменения элемента.
//          НаименованиеКолонкиЭлементов - Строка - Наименование колонки элементов соответствия. 
//          НаименованиеКолонкиВариантов - Строка - Наименование колонки вариантов соответствия.
//          Варианты (REQUIRED) - ТаблицаЗначений - Колонки таблицы:
//      		Ссылка (KEY) - СправочникСсылка.ВариантыОтветовНаТестовыеВопросы - Ссылка на вариант ответа.
//              Вопрос (READONLY) - СправочникСсылка.ТестовыеВопросы - Ссылка на тестовый вопрос.
//              ПометкаУдаления (WRITEONLY) - Булево - Признак того, что следует удалить вариант.
//          	ТекстВарианта (REQUIRED) - Строка - Полный текст варианта ответа.              
//              Верный - Булево - Признак того, что вариант ответа верный.
//              Картинка - ДвоичныеДанные - Картинка варианта.
//              ОбластьНаКартинке - Строка - Координаты варианта на картинке.
//              НомерПоляВвода - Число - Номер поля для ввода текста варианта.
//              ЭтоЭлементСоответствия - Булево - признак того, что вариант относится к колонке элементов соответствия.
//              ВариантыЭлементаСоответствия - ТаблицаЗначений - Колонки таблицы:
//					ВариантОтвета - СправочникСсылка.ВариантыОтветовНаТестовыеВопросы - Соответствующий текущему вариант ответа.
//              ДатаИзменения (READONLY) - Дата - Дата последнего изменения элемента.
//
// 	(KEY) - ключевое поле для поиска элемента в базе данных при операциях обновления данных.
//          Если ключ не заполнен, то будет создан новый элемент.
// 	(REQUIRED) - поле обязательно для заполнения при создании новых элементов.
//               Если не заполнено при создании нового элемента, то будет вызвано исключение.
// 	(READONLY) - поле доступно только для чтения. Заполняется при операциях чтения данных.
//               Игнорируется при операциях создания и обновления данных.
// 	(WRITEONLY) - поле может быть установлено только при операциях обновления и удаления данных.
//                Не заполняется при чтении данных.
//
Функция НастройкиТеста(Знач ЭлектронныйКурс) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.НастройкиТеста";
	
	// Делаем проверки
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ЭлектронныйКурс",
		ЭлектронныйКурс, 
		Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));
		
	ДанныеЭлектронногоКурса = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ЭлектронныйКурс, 
		"Наименование, Тип, Родитель, ПометкаУдаления, Служебный, ВладелецЭлектронногоКурса");
		
	ОбщегоНазначенияКлиентСервер.Проверить(
		ДанныеЭлектронногоКурса.Тип = Перечисления.ТипыЭлектронныхКурсов.Тест,
		НСтр("ru = 'Тип курса не равно ""Тест""'"),
		ИмяФункции);
		
	// Получаем данные
	
	Тест = Справочники.СодержаниеЭлектронныхКурсов.ЕдинственныйТестКурса(ЭлектронныйКурс);
		
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(Тест),
		НСтр("ru = 'Тест электронного курса не найден'"),
		ИмяФункции);
		
	ДанныеЭлектронногоТеста = Справочники.ЭлектронныеТесты.НастройкиТеста(Тест);
	
	ДанныеЭлектронногоТеста.Вставить("ЭлектронныйКурс", ЭлектронныйКурс);
	ДанныеЭлектронногоТеста.Вставить("Родитель", ДанныеЭлектронногоКурса.Родитель);
	ДанныеЭлектронногоТеста.Вставить("Наименование", ДанныеЭлектронногоКурса.Наименование);
	ДанныеЭлектронногоТеста.Вставить("ПометкаУдаления", ДанныеЭлектронногоКурса.ПометкаУдаления);
	ДанныеЭлектронногоТеста.Вставить("Вопросы", ВопросыТеста(ЭлектронныйКурс));
	ДанныеЭлектронногоТеста.Вставить("Служебный", ДанныеЭлектронногоКурса.Служебный);
	ДанныеЭлектронногоТеста.Вставить("Владелец", ДанныеЭлектронногоКурса.ВладелецЭлектронногоКурса);
		
	Возврат ДанныеЭлектронногоТеста;
	
КонецФункции

// Возвращает таблицу вопросов электронного курса типа Тест.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста 
//
Функция ВопросыТеста(Знач ЭлектронныйКурс) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.ВопросыТеста";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ЭлектронныйКурс",
		ЭлектронныйКурс, 
		Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));
		
	Тест = Справочники.СодержаниеЭлектронныхКурсов.ЕдинственныйТестКурса(ЭлектронныйКурс);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(Тест) И ТипЗнч(Тест) = Тип("СправочникСсылка.ЭлектронныеТесты"),
		НСтр("ru = 'Электронный тест не задан'"),
		ИмяФункции);		
	
	МассивВопросовТеста = Справочники.ЭлектронныеТесты.ВопросыТеста(Тест).ВыгрузитьКолонку("Ссылка");
	ДанныеВопросов = Справочники.ТестовыеВопросы.ДанныеВопросов(МассивВопросовТеста, Истина);
	
	ТаблицаВопросов = ДанныеВопросов.Вопросы;
	ТаблицаВопросов.Колонки.Добавить("Варианты", Новый ОписаниеТипов("ТаблицаЗначений"));
	ТаблицаВопросов.Колонки.Добавить("ЭлектронныйКурс", Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));
	
	Для каждого СтрокаТВ Из ДанныеВопросов.Вопросы Цикл	
		СтрокаТВ.Варианты = ДанныеВопросов.Варианты.Скопировать(Новый Структура("Вопрос", СтрокаТВ.Ссылка));
	КонецЦикла;
	
	ТаблицаВопросов.ЗаполнитьЗначения(ЭлектронныйКурс, "ЭлектронныйКурс");
	
	Возврат ТаблицаВопросов;
	
КонецФункции


// Возвращает таблицу вопросов.
//
// Параметры:
//   Вопросы - Массив - массив ссылок справочника ТестовыеВопросы.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста 
//
Функция ДанныеВопросов(Вопросы) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.ДанныеВопросов";
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"Вопросы",
		Вопросы, 
		Новый ОписаниеТипов("Массив"));	
	
	ДанныеВопросов = Справочники.ТестовыеВопросы.ДанныеВопросов(Вопросы, Истина);
	
	ТаблицаВопросов = ДанныеВопросов.Вопросы;
	ТаблицаВопросов.Колонки.Добавить("Варианты", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Для каждого СтрокаТВ Из ДанныеВопросов.Вопросы Цикл	
		СтрокаТВ.Варианты = ДанныеВопросов.Варианты.Скопировать(Новый Структура("Вопрос", СтрокаТВ.Ссылка));
	КонецЦикла;
	
	Возврат ТаблицаВопросов;
	
КонецФункции

// Возвращает таблицу вариантов ответа на тестовый вопрос.
//
// Параметры:
//   ТестовыйВопрос - СправочникСсылка.ТестовыеВопросы - тестовый вопрос.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста 
//
Функция ВариантыОтветовВопроса(Знач ТестовыйВопрос) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.ВариантыОтветовВопроса";
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ТестовыйВопрос) И ТипЗнч(ТестовыйВопрос) = Тип("СправочникСсылка.ТестовыеВопросы"),
		НСтр("ru = 'Тестовый вопрос не задан'"),
		ИмяФункции);		
	
	
	ДанныеВопросов = Справочники.ТестовыеВопросы.ДанныеВопросов(ТестовыйВопрос, Истина);
	
	Возврат  ДанныеВопросов.Варианты;	
	
КонецФункции

// Возвращает новую структуру настроек теста.
//
// Возвращаемое значение:
//  Структура - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста
//
Функция НовыеНастройкиТеста() Экспорт
	
	РеквизитыСправочникаТесты = Метаданные.Справочники.ЭлектронныеТесты.Реквизиты;
	РеквизитыСправочникаЭлектронныеКурсы = Метаданные.Справочники.ЭлектронныеКурсы.Реквизиты;
	
	НовыеНастройки = Новый Структура;
	НовыеНастройки.Вставить("Родитель", Неопределено);
	НовыеНастройки.Вставить("Наименование", "");
	НовыеНастройки.Вставить("ВремяТестаВСекундах", 0);
	НовыеНастройки.Вставить("КоличествоПопыток", РеквизитыСправочникаТесты.КоличествоПопыток.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("КоличествоВопросов", РеквизитыСправочникаТесты.КоличествоВопросов.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("РазрешитьИсправлятьОшибки", РеквизитыСправочникаТесты.РазрешитьИсправлятьОшибки.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("ПеремешиватьВопросы", РеквизитыСправочникаТесты.ПеремешиватьВопросы.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("ПоказыватьРезультатОтвета", РеквизитыСправочникаТесты.ПоказыватьРезультатОтвета.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("ПоказыватьСтатистику", РеквизитыСправочникаТесты.ПоказыватьСтатистику.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("ПоказыватьПравильныеОтветы", РеквизитыСправочникаТесты.ПоказыватьПравильныеОтветы.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("Вопросы", НоваяТаблицаВопросовТеста());	
	НовыеНастройки.Вставить("Служебный", РеквизитыСправочникаЭлектронныеКурсы.Служебный.ЗначениеЗаполнения);
	НовыеНастройки.Вставить("Владелец", РеквизитыСправочникаЭлектронныеКурсы.ВладелецЭлектронногоКурса.ЗначениеЗаполнения);
	
	Возврат НовыеНастройки;
	
КонецФункции

// Создает, обновляет или удаляет электронный курс типа Тест.
//
// Параметры:
//   СтруктураТеста - Структура - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста
//   Замещать - Булево - Если Истина(по умолчанию), то будет заменена вся структура теста.
//                       Переданные строки таблиц будут добавлены, а отсутствующие удалены.
//                       Отсутствующие настройки будут установлены в значения по умолчанию.
//                       Если Ложь, то переданные настройки будут добавлены или обновлены.
//   КонтекстРедактирования - Произвольный - любое значение, которое
//   будет в дальнейшем доступно в обработчиках событий переопределяемого модуля.
//
// Возвращаемое значение:
//  Структура - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста
//
Функция УстановитьНастройкиТеста(Знач СтруктураТеста, Знач Замещать = Истина, Знач КонтекстРедактирования = Неопределено) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.УстановитьНастройкиТеста";
	
	// Делаем проверки
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"СтруктураТеста",
		СтруктураТеста, 
		Новый ОписаниеТипов("Структура"));
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"Замещать",
		Замещать, 
		Новый ОписаниеТипов("Булево"));		
				
	// Записываем настройки
	
	НачатьТранзакцию();

	Попытка
		 
		// Получаем данные
		
		ЭлектронныйКурс = Неопределено;		
		СтруктураТеста.Свойство("ЭлектронныйКурс", ЭлектронныйКурс); 
		
		НаименованиеКурса = Неопределено;
		СтруктураТеста.Свойство("Наименование", НаименованиеКурса);
		
		РодительКурса = Неопределено;
		СтруктураТеста.Свойство("Родитель", РодительКурса);
		
		ВопросыТеста = Неопределено;
		СтруктураТеста.Свойство("Вопросы", ВопросыТеста);
		
		ПометкаУдаленияКурса = Неопределено;
		СтруктураТеста.Свойство("ПометкаУдаления", ПометкаУдаленияКурса);
		
		СлужебныйКурса = Неопределено;
		СтруктураТеста.Свойство("Служебный", СлужебныйКурса);

		ВладелецКурса = Неопределено;
		СтруктураТеста.Свойство("Владелец", ВладелецКурса);
		
		ЭтоНовыйКурс = Ложь;
		
		Если ЗначениеЗаполнено(ЭлектронныйКурс) Тогда
			
			// Обновляем курс
			
			ЭлектронныйТест = Справочники.СодержаниеЭлектронныхКурсов.ЕдинственныйТестКурса(ЭлектронныйКурс);
			
			ОбщегоНазначенияКлиентСервер.Проверить(
				ЗначениеЗаполнено(ЭлектронныйТест),
				НСтр("ru = 'Электронный тест курса не найден'"),
				ИмяФункции);
			
			БлокировкаДанных = Новый БлокировкаДанных;
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЭлектронныеТесты");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлектронныйТест);
			
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ЭлектронныеКурсы");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ЭлектронныйКурс);
			
			ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
			БлокировкаДанных.Заблокировать();						
			
			ЭлектронныйКурсОбъект = ЭлектронныйКурс.ПолучитьОбъект();
			
		Иначе
			
			ЭтоНовыйКурс = Истина;
			
			// Создаем курс
			
			ОбщегоНазначенияКлиентСервер.Проверить(
				ЗначениеЗаполнено(НаименованиеКурса) И ТипЗнч(НаименованиеКурса) = Тип("Строка"),
				НСтр("ru = 'Наименование курса не задано или задано неверно'"),
				ИмяФункции);									
				
			ЭлектронныйКурсОбъект = Справочники.ЭлектронныеКурсы.СоздатьЭлемент();
	
			Справочники.ЭлектронныеКурсы.ЗаполнитьРеквизитыНовогоЭлектронногоКурса(
				ЭлектронныйКурсОбъект, НаименованиеКурса, Перечисления.ТипыЭлектронныхКурсов.Тест, РодительКурса, КонтекстРедактирования);
	
		КонецЕсли;

		// Устанавливаем реквизиты курса
		
		Если НаименованиеКурса <> Неопределено Тогда
			ОбщегоНазначенияКлиентСервер.Проверить(
				ЗначениеЗаполнено(НаименованиеКурса) И ТипЗнч(НаименованиеКурса) = Тип("Строка"),
				НСтр("ru = 'Наименование курса не может быть пустым'"),
				ИмяФункции);				
			ЭлектронныйКурсОбъект.Наименование = НаименованиеКурса;
		КонецЕсли;
		
		Если РодительКурса <> Неопределено Тогда
			ЭлектронныйКурсОбъект.Родитель = РодительКурса;
		КонецЕсли;
		
		Если ВладелецКурса <> Неопределено Тогда
			ЭлектронныйКурсОбъект.ВладелецЭлектронногоКурса = ВладелецКурса;
		КонецЕсли;
		
		Если СлужебныйКурса <> Неопределено Тогда
		
			ОбщегоНазначенияКлиентСервер.Проверить(
				ТипЗнч(СлужебныйКурса) = Тип("Булево"),
				НСтр("ru = 'Параметр Служебный должен быть типа Булево'"),
				ИмяФункции);
				
			ЭлектронныйКурсОбъект.Служебный = СлужебныйКурса;
				
		КонецЕсли;
					
		ЭлектронныйКурсОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);			
		
		Если НЕ ЭтоНовыйКурс 
			И ПометкаУдаленияКурса <> Неопределено
			И ЭлектронныйКурсОбъект.ПометкаУдаления <> ПометкаУдаленияКурса Тогда
			ЭлектронныйКурсОбъект.УстановитьПометкуУдаления(ПометкаУдаленияКурса, Истина);
		Иначе			
			ЭлектронныйКурсОбъект.Записать();		
		КонецЕсли;
		
		ЭлектронныйКурс = ЭлектронныйКурсОбъект.Ссылка;
		
		Если ЭтоНовыйКурс Тогда
			РазработкаЭлектронныхКурсовПереопределяемый.ПриЗаписиНовогоЭлектронногоКурса(ЭлектронныйКурс, КонтекстРедактирования);
		КонецЕсли;
		
		// Добавляем в курс тест
		
		Если ЭтоНовыйКурс Тогда
			
			ЭлектронныйТест = Справочники.ЭлектронныеТесты.СоздатьТест(ЭлектронныйКурс, НаименованиеКурса, КонтекстРедактирования);
			
			Справочники.ЭлектронныеКурсы.ДобавитьЭлементСодержания(
									ЭлектронныйКурс,
									ЭлектронныйТест,
									Неопределено,
									Ложь,
									НаименованиеКурса,
									Перечисления.ТипыЭлементовСодержанияЭлектронногоКурса.Тест,
									Неопределено,
									КонтекстРедактирования);
									
		КонецЕсли;									
		
		// Изменяем настройки теста
		
		СвойстваДляОбновления = Новый Массив();
		СвойстваДляОбновления.Добавить("ВремяТестаВСекундах");
		СвойстваДляОбновления.Добавить("КоличествоПопыток");
		СвойстваДляОбновления.Добавить("КоличествоВопросов");
		СвойстваДляОбновления.Добавить("РазрешитьИсправлятьОшибки");
		СвойстваДляОбновления.Добавить("ПеремешиватьВопросы");
		СвойстваДляОбновления.Добавить("ПоказыватьРезультатОтвета");
		СвойстваДляОбновления.Добавить("ПоказыватьСтатистику");
		СвойстваДляОбновления.Добавить("ПоказыватьПравильныеОтветы");
		
		РеквизитыСправочникаТесты = Неопределено;
		
		ЭлектронныйТестОбъект = ЭлектронныйТест.ПолучитьОбъект();
		ЭлектронныйТестОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
		
		Для каждого ИмяСвойства Из СвойстваДляОбновления Цикл
									
			ЗначениеСвойства = Неопределено;
			СтруктураТеста.Свойство(ИмяСвойства, ЗначениеСвойства);
			
			Если ИмяСвойства = "ВремяТестаВСекундах" Тогда
				ИмяСвойства = "ВремяТеста";
				Если ЗначениеСвойства <> Неопределено Тогда
					ЗначениеСвойства = ИзучениеЭлектронныхКурсовСлужебныйSCORM.ДатаИзКоличестваСекунд(ЗначениеСвойства);
				КонецЕсли;
			КонецЕсли;
			
			Если ЗначениеСвойства = Неопределено И НЕ Замещать Тогда
				Продолжить;
			КонецЕсли;
			
			Если ЗначениеСвойства = Неопределено И Замещать Тогда
				Если РеквизитыСправочникаТесты = Неопределено Тогда
					РеквизитыСправочникаТесты = Метаданные.Справочники.ЭлектронныеТесты.Реквизиты;
				КонецЕсли;
				ЗначениеСвойства = РеквизитыСправочникаТесты[ИмяСвойства].ЗначениеЗаполнения;
			КонецЕсли;
			
			ЭлектронныйТестОбъект[ИмяСвойства] = ЗначениеСвойства;
					
		КонецЦикла;
		 
		ЭлектронныйТестОбъект.Записать();
		
		// Изменяем вопросы
		
		Если ВопросыТеста <> Неопределено Тогда										
			УстановитьВопросыТеста(ЭлектронныйКурс, ВопросыТеста, Замещать, КонтекстРедактирования);			
		КонецЕсли;
		
		// Завершаем
		
	 	ЗафиксироватьТранзакцию();
	 
	 Исключение
	 
	  	ОтменитьТранзакцию();
	 	ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
	 	ВызватьИсключение;
	 	
	 КонецПопытки;
	 
	 Возврат НастройкиТеста(ЭлектронныйКурс);
	 
КонецФункции

// Возвращает новую пустую таблицу вопросов теста.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста 
//
Функция НоваяТаблицаВопросовТеста() Экспорт
	
	НоваяТаблица = Новый ТаблицаЗначений;	
	НоваяТаблица.Колонки.Добавить("Задание", Новый ОписаниеТипов("ФорматированныйДокумент"));
	НоваяТаблица.Колонки.Добавить("ТипВопроса", Новый ОписаниеТипов("ПеречислениеСсылка.ТипыТестовыхВопросов"));
	НоваяТаблица.Колонки.Добавить("Картинка", Новый ОписаниеТипов("ДвоичныеДанные"));
	НоваяТаблица.Колонки.Добавить("НаименованиеКолонкиЭлементов", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("НаименованиеКолонкиВариантов", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Варианты", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат НоваяТаблица;
		
КонецФункции

// Создает, обновляет или удаляет вопросы теста.
//
// Параметры:
//   ЭлектронныйКурс - СправочникСсылка.ЭлектронныеКурсы - электронный курс типа "Тест".
//   ТаблицаВопросов - ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста.
//   Замещать - Булево - Если Истина(по умолчанию), то будут заменены все вопросы теста.
//                       Переданные вопросы будут добавлены, а отсутствующие удалены.
//                       Если Ложь, то переданные вопросы будут добавлены или обновлены.
//   КонтекстРедактирования - Произвольный - любое значение, которое
//   будет в дальнейшем доступно в обработчиках событий переопределяемого модуля.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста
//
Функция УстановитьВопросыТеста(Знач ЭлектронныйКурс, Знач ТаблицаВопросов, Знач Замещать = Истина, Знач КонтекстРедактирования = Неопределено) Экспорт
	
	ИмяФункции = "РазработкаЭлектронныхКурсов.УстановитьВопросыТеста";
	
	// Делаем проверки
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ЭлектронныйКурс",
		ЭлектронныйКурс, 
		Новый ОписаниеТипов("СправочникСсылка.ЭлектронныеКурсы"));	
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ТаблицаВопросов",
		ТаблицаВопросов, 
		Новый ОписаниеТипов("ТаблицаЗначений"));
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"Замещать",
		Замещать, 
		Новый ОписаниеТипов("Булево"));
		
	ЭлектронныйТест = Справочники.СодержаниеЭлектронныхКурсов.ЕдинственныйТестКурса(ЭлектронныйКурс);
	
	ОбщегоНазначенияКлиентСервер.Проверить(
		ЗначениеЗаполнено(ЭлектронныйТест),
		НСтр("ru = 'Электронный тест курса не найден'"),
		ИмяФункции);		
		
	НачатьТранзакцию();
	
	Попытка
		
		Если Замещать Тогда
			
			ВсеСтраницыТеста = Справочники.СтраницыЭлементовЭлектронныхКурсов.ВсеЭлементы(ЭлектронныйТест,,Тип("СправочникСсылка.ТестовыеВопросы"));
			
			Если ВсеСтраницыТеста.Количество() > 0 Тогда
				ВсеВопросыТаблицы = Новый Массив;
				Если ТаблицаВопросов.Колонки.Найти("Ссылка") <> Неопределено Тогда
					ВсеВопросыТаблицы = ТаблицаВопросов.ВыгрузитьКолонку("Ссылка");	
				КонецЕсли;
				Для каждого СтрокаСТ Из ВсеСтраницыТеста Цикл
					Если ВсеВопросыТаблицы.Найти(СтрокаСТ.СсылкаНаЭлементКурса) = Неопределено Тогда
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.СтраницыЭлементовЭлектронныхКурсов");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СтрокаСТ.Ссылка);
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ТестовыеВопросы");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СтрокаСТ.СсылкаНаЭлементКурса);						
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						БлокировкаДанных.Заблокировать();					
						
						СтраницаОбъект = СтрокаСТ.Ссылка.ПолучитьОбъект();
						СтраницаОбъект.УстановитьПометкуУдаления(Истина, Истина);
						СтраницаОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
						СтраницаОбъект.Записать();
						
						ВопросОбъект = СтрокаСТ.СсылкаНаЭлементКурса.ПолучитьОбъект();
						ВопросОбъект.УстановитьПометкуУдаления(Истина, Истина);
						СтраницаОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
						ВопросОбъект.Записать();						
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;			
			
		КонецЕсли;
		
		Для каждого СтрокаТВ Из ТаблицаВопросов Цикл
			
			ТестовыйВопрос = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Ссылка", Истина, ТестовыйВопрос);
			
			ЭтоНовыйВопрос = Ложь;
			ПометкаУдаления = Неопределено;
			ЗаписатьВопрос = Ложь;
			
			Если ТестовыйВопрос = Неопределено Тогда
				
				ЭтоНовыйВопрос = Истина;
				ЗаписатьВопрос = Истина;
				
				ТестовыйВопросОбъект = Справочники.ТестовыеВопросы.СоздатьЭлемент();
				ТестовыйВопросОбъект.Заполнить(Неопределено);
				
			Иначе
				
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ТестовыеВопросы");
				ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ТестовыйВопрос);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаДанных.Заблокировать();
				
	    		ТестовыйВопросОбъект = ТестовыйВопрос.ПолучитьОбъект();
				
				ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ПометкаУдаления", Истина, ПометкаУдаления);
			
				Если ПометкаУдаления <> Неопределено Тогда
					ТестовыйВопросОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
				КонецЕсли;
				
			КонецЕсли;
			
			// Задание
			
			Задание = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Задание", Истина, Задание);

			Если ЭтоНовыйВопрос Тогда			
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Задание) = Тип("ФорматированныйДокумент"),
					НСтр("ru = 'Задание вопроса не задано'"),
					ИмяФункции);					
			КонецЕсли;
			
			Если Задание <> Неопределено Тогда
				
				ЗаписатьВопрос = Истина;
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Задание) = Тип("ФорматированныйДокумент"),
					НСтр("ru = 'Тип задания неверный'"),
					ИмяФункции);
				
				Наименование = ЭлектронноеОбучениеСлужебный.НаименованиеЭлементаИзТекста(Задание);
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЗначениеЗаполнено(Наименование) И ТипЗнч(Наименование) = Тип("Строка"),
					НСтр("ru = 'Наименование вопроса не задано или задано неверно'"),
					ИмяФункции);
					
				ТестовыйВопросОбъект.Наименование = Наименование;
				ТестовыйВопросОбъект.Задание = Новый ХранилищеЗначения(Задание);							
				
			КонецЕсли;
				
			// ТипВопроса
			
			ТипВопроса = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ТипВопроса", Истина, ТипВопроса);
			
			Если ЭтоНовыйВопрос Тогда			
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЗначениеЗаполнено(ТипВопроса),
					НСтр("ru = 'Тип вопроса не задан'"),
					ИмяФункции);					
			КонецЕсли;
			
			Если ТипВопроса <> Неопределено Тогда
				
				ЗаписатьВопрос = Истина;
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(ТипВопроса) = Тип("ПеречислениеСсылка.ТипыТестовыхВопросов"),
					НСтр("ru = 'Тип задания задан неверно'"),
					ИмяФункции);	
					
				ТестовыйВопросОбъект.ТипВопроса = ТипВопроса;				
					
			КонецЕсли;
			
			// Картинка
			
			Картинка = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Картинка", Истина, Картинка);
			
			Если Картинка <> Неопределено Тогда
				
				ЗаписатьВопрос = Истина;
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Картинка) = Тип("ДвоичныеДанные"),
					НСтр("ru = 'Картинка вопроса не задана'"),
					ИмяФункции);	
					
				ТестовыйВопросОбъект.Картинка = Новый ХранилищеЗначения(Картинка);				
					
			КонецЕсли;
			
			// Наименование колонки элементов
			
			НаименованиеКолонкиЭлементов = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "НаименованиеКолонкиЭлементов", Истина, НаименованиеКолонкиЭлементов);
			
			Если НаименованиеКолонкиЭлементов <> Неопределено Тогда
				ЗаписатьВопрос = Истина;
				ТестовыйВопросОбъект.НаименованиеКолонкиЭлементов = НаименованиеКолонкиЭлементов;				
			КонецЕсли;
			
			// Наименование колонки вариантов
			
			НаименованиеКолонкиВариантов = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "НаименованиеКолонкиВариантов", Истина, НаименованиеКолонкиВариантов);
			
			Если НаименованиеКолонкиВариантов <> Неопределено Тогда
				ЗаписатьВопрос = Истина;
				ТестовыйВопросОбъект.НаименованиеКолонкиВариантов = НаименованиеКолонкиВариантов;				
			КонецЕсли;
			
			// Записываем вопрос
			
			Если ЗаписатьВопрос Тогда
			
				ТестовыйВопросОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
				ТестовыйВопросОбъект.Записать();
				ТестовыйВопрос = ТестовыйВопросОбъект.Ссылка;
				
			КонецЕсли;
				
			// Добавляем/удаляем страницу теста

			ДобавитьСтраницуВопроса = ЭтоНовыйВопрос;
			
			Если НЕ ДобавитьСтраницуВопроса
				И Справочники.СтраницыЭлементовЭлектронныхКурсов.НайтиПоСсылкеНаЭлемент(
					ТестовыйВопрос, ЭлектронныйТест, Ложь) = Неопределено Тогда
					
				ДобавитьСтраницуВопроса = Истина;					
					
			КонецЕсли;
			
			Если ДобавитьСтраницуВопроса Тогда
				Справочники.СтраницыЭлементовЭлектронныхКурсов.ДобавитьСтраницу(
					ЭлектронныйТест, ТестовыйВопрос, Неопределено, КонтекстРедактирования);
			КонецЕсли;
			
			Если ПометкаУдаления <> Неопределено Тогда
				
				СтраницаТеста = Справочники.СтраницыЭлементовЭлектронныхКурсов.НайтиПоСсылкеНаЭлемент(
					ТестовыйВопрос, ЭлектронныйТест, Неопределено);
					
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЗначениеЗаполнено(СтраницаТеста),
					НСтр("ru = 'Страница теста не найдена'"),
					ИмяФункции);
					
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.СтраницыЭлементовЭлектронныхКурсов");
				ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СтраницаТеста);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаДанных.Заблокировать();					
					
				СтраницаТестаОбъект = СтраницаТеста.ПолучитьОбъект();					
				СтраницаТестаОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
				СтраницаТестаОбъект.Записать();				
				
			КонецЕсли;
			
			// Варианты
			
			Варианты = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Варианты", Истина, Варианты);
			
			Если ЭтоНовыйВопрос Тогда
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Варианты) = Тип("ТаблицаЗначений"),
					НСтр("ru = 'Варианты вопроса не заданы'"),
					ИмяФункции);	
			КонецЕсли;
			
			Если Варианты <> Неопределено Тогда
				УстановитьВариантыОтветов(ТестовыйВопрос, Варианты, Замещать, КонтекстРедактирования);
			КонецЕсли;
			
		КонецЦикла;			
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем данные
	
	Возврат ВопросыТеста(ЭлектронныйКурс);
	
КонецФункции

// Возвращает новую пустую таблицу вариантов ответа на тестовый вопрос.
//
// Возвращаемое значение:
//  ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста 
//
Функция НоваяТаблицаВариантовОтветов() Экспорт
		
	НоваяТаблица = Новый ТаблицаЗначений;	
	НоваяТаблица.Колонки.Добавить("ТекстВарианта", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("Верный", Новый ОписаниеТипов("Булево"));
	НоваяТаблица.Колонки.Добавить("Картинка", Новый ОписаниеТипов("ДвоичныеДанные"));
	НоваяТаблица.Колонки.Добавить("ОбластьНаКартинке", Новый ОписаниеТипов("Строка"));
	НоваяТаблица.Колонки.Добавить("НомерПоляВвода", Новый ОписаниеТипов("Число"));
	НоваяТаблица.Колонки.Добавить("ЭтоЭлементСоответствия", Новый ОписаниеТипов("Булево"));
	НоваяТаблица.Колонки.Добавить("ВариантыЭлементаСоответствия", Новый ОписаниеТипов("ТаблицаЗначений"));
	
	Возврат НоваяТаблица;
	
КонецФункции

// Создает, обновляет или удаляет варианты ответов вопроса.
//
// Параметры:
//   ТестовыйВопрос - СправочникСсылка.ТестовыеВопросы - тестовый вопрос.
//   ТаблицаВариантов - ТаблицаЗначений - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста.
//   Замещать - Булево - Если Истина(по умолчанию), то будут заменены вся варианты.
//                       Переданные строки таблиц будут добавлены, а отсутствующие удалены.
//                       Если Ложь, то переданные варианты будут добавлены или обновлены.
//   КонтекстРедактирования - Произвольный - любое значение, которое
//   будет в дальнейшем доступно в обработчиках событий переопределяемого модуля.
//
// Возвращаемое значение:
//  Структура - описание см. РазработкаЭлектронныхКурсов.НастройкиТеста
//
Функция УстановитьВариантыОтветов(Знач ТестовыйВопрос, Знач ТаблицаВариантов, Знач Замещать = Истина, Знач КонтекстРедактирования = Неопределено) Экспорт
		
	ИмяФункции = "РазработкаЭлектронныхКурсов.УстановитьВариантыОтветов";
	
	// Делаем проверки
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ТестовыйВопрос",
		ТестовыйВопрос, 
		Новый ОписаниеТипов("СправочникСсылка.ТестовыеВопросы"));	
	
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"ТаблицаВариантов",
		ТаблицаВариантов, 
		Новый ОписаниеТипов("ТаблицаЗначений"));
		
	ОбщегоНазначенияКлиентСервер.ПроверитьПараметр(
		ИмяФункции, 
		"Замещать",
		Замещать, 
		Новый ОписаниеТипов("Булево"));
		
	НачатьТранзакцию();
	
	Попытка
		
	
		Если Замещать Тогда
			
			ДанныеВопроса = Справочники.ТестовыеВопросы.ДанныеВопросов(ТестовыйВопрос, Истина);
			
			Если ДанныеВопроса.Варианты.Количество() > 0 Тогда
				
				ВсеВариантыТаблицы = Новый Массив;
				
				Если ТаблицаВариантов.Колонки.Найти("Ссылка") <> Неопределено Тогда
					ВсеВариантыТаблицы = ТаблицаВариантов.ВыгрузитьКолонку("Ссылка");	
				КонецЕсли;
				
				Для каждого СтрокаТВ Из ДанныеВопроса.Варианты Цикл
					Если ВсеВариантыТаблицы.Найти(СтрокаТВ.Ссылка) = Неопределено Тогда
						
						БлокировкаДанных = Новый БлокировкаДанных;
						ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ВариантыОтветовНаТестовыеВопросы");
						ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", СтрокаТВ.Ссылка);					
						ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
						БлокировкаДанных.Заблокировать();					
						
						
						ВариантОбъект = СтрокаТВ.Ссылка.ПолучитьОбъект();
						ВариантОбъект.УстановитьПометкуУдаления(Истина, Истина);
						ВариантОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);						
						ВариантОбъект.Записать();										
						
					КонецЕсли;
				КонецЦикла;
			КонецЕсли;				
	
	    КонецЕсли;
		
			
		Для каждого СтрокаТВ Из ТаблицаВариантов Цикл
			
			ВариантОтвета = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Ссылка", Истина, ВариантОтвета);
			
			ЭтоНовыйВариант = Ложь;
			ПометкаУдаления = Неопределено;
			
			Если ВариантОтвета = Неопределено Тогда
				
				ЭтоНовыйВариант = Истина;
				
				ВариантОтветаОбъект = Справочники.ВариантыОтветовНаТестовыеВопросы.СоздатьЭлемент();
				ВариантОтветаОбъект.Заполнить(Неопределено);
				ВариантОтветаОбъект.Владелец = ТестовыйВопрос;
				
			Иначе
				
				БлокировкаДанных = Новый БлокировкаДанных;
				ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.ВариантыОтветовНаТестовыеВопросы");
				ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", ВариантОтвета);
				ЭлементБлокировкиДанных.Режим = РежимБлокировкиДанных.Исключительный;
				БлокировкаДанных.Заблокировать();
				
				ВариантОтветаОбъект = ВариантОтвета.ПолучитьОбъект();
				
				ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ПометкаУдаления", Истина, ПометкаУдаления);
			
				Если ПометкаУдаления <> Неопределено Тогда
					ВариантОтветаОбъект.УстановитьПометкуУдаления(ПометкаУдаления, Истина);
				КонецЕсли;
				
			КонецЕсли;
						
			// Текст варианта
			
			ТекстВарианта = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ТекстВарианта", Истина, ТекстВарианта);

			Если ЭтоНовыйВариант Тогда			
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЗначениеЗаполнено(ТекстВарианта),
					НСтр("ru = 'Текст варианта не задан'"),
					ИмяФункции);					
			КонецЕсли;
			
			Если ТекстВарианта <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(ТекстВарианта) = Тип("Строка"),
					НСтр("ru = 'Тип текста варианта неверный'"),
					ИмяФункции);
				
				Наименование = ЭлектронноеОбучениеСлужебный.НаименованиеЭлементаИзТекста(ТекстВарианта);
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ЗначениеЗаполнено(Наименование) И ТипЗнч(Наименование) = Тип("Строка"),
					НСтр("ru = 'Наименование варианта ответа не задано или задано неверно'"),
					ИмяФункции);
					
				ВариантОтветаОбъект.Наименование = Наименование;
				ВариантОтветаОбъект.ТекстВарианта = Новый ХранилищеЗначения(ТекстВарианта);							
				
			КонецЕсли;
			
			// Верный
			
			Верный = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Верный", Истина, Верный);

			Если Верный <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Верный) = Тип("Булево"),
					НСтр("ru = 'Признак Верный указан неверно'"),
					ИмяФункции);
				
				ВариантОтветаОбъект.Верный = Верный;							
				
			КонецЕсли;
			
			// Картинка
			
			Картинка = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "Картинка", Истина, Картинка);
			
			Если Картинка <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(Картинка) = Тип("ДвоичныеДанные"),
					НСтр("ru = 'Картинка вопроса не задана'"),
					ИмяФункции);	
					
				ВариантОтветаОбъект.Картинка = Новый ХранилищеЗначения(Картинка);				
					
			КонецЕсли;			
			
			// Область на картинке
			
			ОбластьНаКартинке = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ОбластьНаКартинке", Истина, ОбластьНаКартинке);

			Если ОбластьНаКартинке <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(ОбластьНаКартинке) = Тип("Строка"),
					НСтр("ru = 'Признак область на картинке указан неверно'"),
					ИмяФункции);
				
				ВариантОтветаОбъект.ОбластьНаКартинке = ОбластьНаКартинке;							
				
			КонецЕсли;
						
			// Номер поля ввода
			
			НомерПоляВвода = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "НомерПоляВвода", Истина, НомерПоляВвода);

			Если НомерПоляВвода <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(НомерПоляВвода) = Тип("Число"),
					НСтр("ru = 'Признак номер поля ввода указан неверно'"),
					ИмяФункции);
				
				ВариантОтветаОбъект.НомерПоляВвода = НомерПоляВвода;							
				
			КонецЕсли;
			
			// Это элемент соответствия
			
			ЭтоЭлементСоответствия = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ЭтоЭлементСоответствия", Истина, ЭтоЭлементСоответствия);

			Если ЭтоЭлементСоответствия <> Неопределено Тогда
				
				ОбщегоНазначенияКлиентСервер.Проверить(
					ТипЗнч(ЭтоЭлементСоответствия) = Тип("Булево"),
					НСтр("ru = 'Признак это элемент соответствия указан неверно'"),
					ИмяФункции);
				
				ВариантОтветаОбъект.ЭтоЭлементСоответствия = ЭтоЭлементСоответствия;							
				
			КонецЕсли;			
			
			// ВариантыЭлементаСоответствия
			
			ВариантыЭлементаСоответствия = Неопределено;
			ЭлектронноеОбучениеСлужебный.СвойствоКоллекции(СтрокаТВ, "ВариантыЭлементаСоответствия", Истина, ВариантыЭлементаСоответствия);

			Если ВариантыЭлементаСоответствия <> Неопределено Тогда
				
				ВариантОтветаОбъект.ВариантыЭлементаСоответствия.Очистить();
				
				Для каждого СтрокаВЭС Из ВариантыЭлементаСоответствия Цикл
					НоваяСтрокаТВЭС = ВариантОтветаОбъект.ВариантыЭлементаСоответствия.Добавить();
					НоваяСтрокаТВЭС.ВариантОтвета = СтрокаВЭС.ВариантОтвета;
				КонецЦикла;
				
			КонецЕсли;
			
			// Записываем вариант
			
			ВариантОтветаОбъект.ДополнительныеСвойства.Вставить("КонтекстРедактирования", КонтекстРедактирования);
			ВариантОтветаОбъект.Записать();			
			
		КонецЦикла;			
		
		ЗафиксироватьТранзакцию();
	
	Исключение
	
	 	ОтменитьТранзакцию();
		ЭлектронноеОбучениеСлужебный.ЗаписатьОшибкуВЖурналРегистрации(ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
		ВызватьИсключение;
		
	КонецПопытки;
	
	// Возвращаем данные
	
	ВариантыОтветовВопроса(ТестовыйВопрос);
	
КонецФункции

#КонецОбласти
